[
  {
    "period": "July 2024 - Present",
    "title": "Senior QA Engineer",
    "company": "Acumatica",
    "location": "Ottawa, CA",
    "technologies": ["Selenium", "C#", "JIRA"],
    "responsibilities": [
      "Develop, and maintain robust automation frameworks for Acumatica ERP modules using Selenium WebDriver with C#, ensuring scalability and maintainability.",
      "Collaborate with product owners and developers to analyze business requirements, design comprehensive test strategies, and implement automated test coverage for new features.",
      "Led end-to-end regression testing for release cycle, integrating automated test execution into CI/CD pipelines to accelerate release validation.",
      "Improved test automation coverage by optimizing framework and automating verification for defect fixes and regression-prone areas."
    ],
    "type": "current"
  },
  {
    "period": "June 2021 - July 2024",
    "title": "Senior QA Engineer",
    "company": "Behavox Software",
    "location": "Montreal, CA",
    "technologies": ["Cucumber", "Cypress", "pytest", "GitLab", "GCP", "Kafka"],
    "responsibilities": [
      "Responsible for testing and automation of Data intensive B2B application.",
      "Developing tests across pyramid (API, integration, e2e) with pytest and Cypress frameworks utilizing Docker and GCP resources such as BigQuery, Kafka, Pubsub etc.",
      "Designing, executing, and documenting e2e and integration tests using Xray for feature validation and UAT.",
      "Creating and maintaining test suite running in CI/CD pipelines for pre-merge feature testing.",
      "Implementing seamless data ingestion pipelines for development and UAT environments.",
      "Perform regression/smoke testing during release schedule and provide go/no-go feedback for the release.",
      "Help performance testing team with test data creation and test runs to find bottleneck in the system."
    ],
    "achievements": [
      "Collaborated with test manager to reduced release cycle from 8 to 3 weeks, doubling yearly releases from 6 to 12.",
      "Built Cucumber and pytest frameworks from scratch for specialized application, trained team and automated 2500+ test cases.",
      "Enhanced Cypress framework, improving performance and speeding up QA process."
    ]
  },
  {
    "period": "Jan 2020 - May 2021",
    "title": "QA Practice Lead",
    "company": "Fidor Solutions",
    "location": "Dubai, UAE",
    "technologies": [
      "Selenium+Python",
      "TestRail",
      "Postman",
      "AWS",
      "Jenkins",
      "Appium",
      "OWASP ZAP"
    ],
    "responsibilities": [
      "Led 3 junior QAs, offering mentorship in QA processes and automation.",
      "Contributed to Fintech product design, presenting feature demos to marketing.",
      "Conducted thorough sprint feature testing, documenting in TestRail, tracking bugs in JIRA.",
      "Automated UI, API, and Mobile testing with Selenium, Python, and Appium.",
      "Introduced new tools and QA guidelines to expedite release time."
    ],
    "achievements": [
      "Created QA infrastructure from scratch, including automated framework with nightly pipelines and bug logging for daily regression testing.",
      "Introduced OWASP ZAP Automation for Dynamic Security Testing, improving system security.",
      "Maintained 80% automation goal, executing 1500 test cases in 3 hours."
    ]
  },
  {
    "period": "Oct 2018 - Nov 2019",
    "title": "SDET",
    "company": "Aera Technologies",
    "location": "Pune, IN",
    "technologies": ["Selenium+Java", "Jmeter", "Browser Stack", "SQL"],
    "responsibilities": [
      "Automated Regression and Sanity tests by integrating UI and API automation with Gradle, Selenium, and RestAPI using the Page Object framework.",
      "Coordinated automation script execution across browsers and platforms with BrowserStack for extensive testing coverage.",
      "Performed basic performance testing on select applications with JMeter to guarantee optimal system functionality under diverse load conditions."
    ]
  },
  {
    "period": "Nov 2016 - Oct 2018",
    "title": "QA Engineer",
    "company": "Accenture India",
    "location": "Pune, IN",
    "technologies": ["Selenium+Java", "TestNG", "Jenkins"],
    "responsibilities": [
      "Collaborated as QA engineer in Agile teams of 6 developers per team, spanning 20 teams, testing Banking Applications.",
      "Designed and tested sprint-developed applications, identifying and documenting bugs in JIRA pre-deployment to UAT.",
      "Automated regression test cases for UI and Backend (SOAP) with Selenium WebDriver, Java, and TestNG for robust testing processes."
    ],
    "achievements": [
      "Worked onsite at client location in Frankfurt, Germany, for 6 months in the UAT team, executing and developing a 3000 test-case suite.",
      "Innovatively integrated features into the UAT framework, saving 2 hours daily in execution time."
    ]
  },
  {
    "period": "April 2014 - Oct 2016",
    "title": "Software Consultant",
    "company": "Syntel India Pvt Ltd",
    "location": "Chennai, IN",
    "technologies": ["HP UFT", "Selenium", "SQL", "HP ALM"],
    "responsibilities": [
      "Led functional testing for Front Office and Mortgage Applications, ensuring thorough validation for each change request.",
      "Performed comprehensive regression testing with every upgrade release to maintain system integrity.",
      "Analyzed requirements, prepared/executed test cases, and logged defects in HP ALM to streamline testing.",
      "Developed automation scripts using Keyword or Hybrid approaches for regression testing during upgrades, leveraging UFT for efficient automation."
    ],
    "achievements": [
      "Led a major upgrade testing project as an ad-hoc Lead, overseeing a 5-member team, completing it within a 6-month timeframe.",
      "Managed the project lifecycle from inception to production release, executing over 3000 business test cases for a seamless transition and successful deployment."
    ]
  }
]
